##ΠΑΝΕΛΛΑΔΙΚΕΣ ΕΞΕΤΑΣΕΙΣ
##HMEΡΗΣΙΩΝ – ΕΣΠΕΡΙΝΩΝ ΕΠΑΓΓΕΛΜΑΤΙΚΩΝ ΛΥΚΕΙΩΝ
##ΣΑΒΒΑΤΟ 6 ΙΟΥΝΙΟΥ 2026
##ΕΞΕΤΑΖΟΜΕΝΟ ΜΑΘΗΜΑ:
##ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΥΠΟΛΟΓΙΣΤΩΝ
##
##ΘΕΜΑ B
##Β2. Δίνεται το παρακάτω τμήμα προγράμματος σε γλώσσα προγραμματισμού Python:
##on=[ˈMARIAˈ, ˈNIKOSˈ, ˈLAZAROSˈ]
##on=[ˈMANOLISˈ] + on
##(1) print on
##on.pop()
##(2) print on
##on.insert(2, ˈADAMˈ)
##(3) print on
##on.pop(1)
##(4) print on
##on=on+[ˈANNAˈ]
##(5) print on
##Να γράψετε στο τετράδιό σας τους αριθμούς (1), (2), (3), (4) και (5) που
##αντιστοιχούν στις εντολές print του παραπάνω τμήματος προγράμματος και
##δίπλα σε κάθε αριθμό το αποτέλεσμα που θα εμφανιστεί στην οθόνη κατά την
##εκτέλεσή του.
##Μονάδες 10

on=['MARIA', 'NIKOS', 'LAZAROS']
on=['MANOLIS'] + on
print(on)
##(1) ['MANOLIS', 'MARIA', 'NIKOS', 'LAZAROS']
on.pop()
print(on)
##(2) ['MANOLIS', 'MARIA', 'NIKOS']
on.insert(2, 'ADAM')
print(on)
##(3) ['MANOLIS', 'MARIA', 'ADAM', 'NIKOS']
on.pop(1)
print(on)
##(4) ['MANOLIS', 'ADAM', 'NIKOS']
on=on+['ANNA']
print(on)
##(5) ['MANOLIS', 'ADAM', 'NIKOS', 'ANNA']

##Β3. Δίνεται το παρακάτω τμήμα προγράμματος σε γλώσσα προγραμματισμού Python:
##i = 1
##while i <= 3:
##    j = 5
##    while j >= 1:
##        print i, j
##        j = j - 1
##    i = i + 1
##Να ξαναγράψετε στο τετράδιό σας το παραπάνω τμήμα προγράμματος,
##αντικαθιστώντας τις εντολές while με for, έτσι ώστε να εμφανίζεται το
##ίδιο αποτέλεσμα.
##Μονάδες 5

i = 1
while i <= 3:
    j = 5
    while j >= 1:
        print(i, j)
        j = j - 1
    i = i + 1
print("-----------------------------------------------------------------------")
for i in range(1, 4):
    for j in range(5, 0, -1):
        print(i, j)

##1 5
##1 4
##1 3
##1 2
##1 1
##2 5
##2 4
##2 3
##2 2
##2 1
##3 5
##3 4
##3 3
##3 2
##3 1
##-----------------------------------
##1 5
##1 4
##1 3
##1 2
##1 1
##2 5
##2 4
##2 3
##2 2
##2 1
##3 5
##3 4
##3 3
##3 2
##3 1
