##ΠΑΝΕΛΛΑΔΙΚΕΣ ΕΞΕΤΑΣΕΙΣ
##HMEΡΗΣΙΩΝ – ΕΣΠΕΡΙΝΩΝ ΕΠΑΓΓΕΛΜΑΤΙΚΩΝ ΛΥΚΕΙΩΝ
##ΣΑΒΒΑΤΟ 6 ΙΟΥΝΙΟΥ 2026
##ΕΞΕΤΑΖΟΜΕΝΟ ΜΑΘΗΜΑ:
##ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΥΠΟΛΟΓΙΣΤΩΝ
##
##ΘΕΜΑ A
##A2. Να γράψετε στο τετράδιό σας τους αριθμούς 1, 2, 3, 4, 5 από τη
##στήλη Α του παρακάτω πίνακα και δίπλα σε καθέναν από τους αριθμούς,
##ένα από τα γράμματα α, β, γ, δ, ε, στ της στήλης Β, που δίνει τη σωστή
##αντιστοίχιση. Σημειώνεται ότι ένα γράμμα από τη στήλη Β θα περισσέψει.
##ΣΤΗΛΗ Α	    	        ΣΤΗΛΗ Β
##1. pow(4,2)    	    	α. True
##2. divmod(2,5)    	    	β. (0,2)
##3. (5<2) or (4>=3)    	γ. 16
##4. not(7!=4+5) and (5>3)    	δ. (2,0)
##5. len(ˈPythonˈ)    	    	ε. False
##    	    	    	    	στ. 6
##Μονάδες 15
##
##print pow(4,2)
##print divmod(2,5)
##print (5<2) or (4>=3)
##print not(7!=4+5) and (5>3)
##print len('Python')
##
##16
##(0, 2)
##True
##False
##6
##
##1. pow(4,2)    	    	γ. 16
##2. divmod(2,5)    	    	β. (0,2)
##3. (5<2) or (4>=3)    	α. True
##4. not(7!=4+5) and (5>3)    	ε. False
##5. len(ˈPythonˈ)    	    	στ. 6
##
##ΘΕΜΑ B
##B1. Δίνεται συνάρτηση με όνομα CheckTax(A), η οποία δέχεται
##τη λίστα Α και επιστρέφει την τιμή True, αν τα στοιχεία της
##είναι ταξινομημένα κατά αύξουσα σειρά, ή False σε κάθε
##άλλη περίπτωση.
##def CheckTax(A):
##    N = (1)
##    f = True
##    for j in range(1, (2) ):
##        if A[j] < (3) :
##            f = (4)
##    return (5)
##Να γράψετε στο τετράδιό σας τους αριθμούς (1), (2), (3), (4) και (5),
##που αντιστοιχούν στα κενά του παραπάνω τμήματος προγράμματος
##και δίπλα σε κάθε αριθμό αυτό που πρέπει να συμπληρωθεί.
##Μονάδες 10
##
def CheckTax(A):
    N = len(A)
    f = True
    for j in range(1, N):
        if A[j] < A[j-1]:
            f = False
    return f

listA=[2,3,5,4,7,8,9]
listB=[2,3,4,5,7,8,9]
print("Τα στοιχεία της λίστας {} είναι ταξινομημένα κατά αύξουσα σειρά: {}".format(listA, CheckTax(listA)))
print("Τα στοιχεία της λίστας {} είναι ταξινομημένα κατά αύξουσα σειρά: {}".format(listB, CheckTax(listB)))

##def CheckTax(A):
##    N = (1)    ## (1) len(A)
##    f = True
##    for j in range(1, (2) ):    ## (2) N
##        if A[j] < (3) :    ## (3) A[j-1]
##            f = (4)    ## (4) False
##    return (5)    ## (5) f
